FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
#include "joint_manager.h"
#include "FreeRTOS.h"
#include "common.h"
#include "drv8825.h"
#include "event.h"
#include "manager.h"
#include "motor_driver.h"
#include "notify.h"
#include "pid_regulator.h"
#include "step_motor.h"
#include "stm32f4xx_hal.h"
#include "task.h"
#include <assert.h>
#include <math.h>
#include <stdint.h>
#include <string.h>

static char const* const TAG = "atlas_joint:joint_manager";

float drv8825_microstep_to_fraction(drv8825_microstep_t microstep);

static inline bool frequency_to_prescaler_and_period(uint32_t frequency_hz,
                                                     uint32_t clock_hz,
                                                     uint32_t max_prescaler,
                                                     uint32_t max_period,
                                                     uint32_t* prescaler,
                                                     uint32_t* period)
{
    if (frequency_hz == 0U || !prescaler || !period) {
        return false;
    }

    uint32_t temp_prescaler = 0U;
    uint32_t temp_period = clock_hz / frequency_hz;

    while (temp_period > max_period && temp_prescaler < max_prescaler) {
        temp_prescaler++;
        temp_period = clock_hz / ((temp_prescaler + 1U) * frequency_hz);
    }
    if (temp_period > max_period) {
        temp_period = max_period;
        temp_prescaler = (clock_hz / (temp_period * frequency_hz)) - 1U;
    }
    if (temp_prescaler > max_prescaler) {
        temp_prescaler = max_prescaler;
    }

    *prescaler = temp_prescaler;
    *period = temp_period;

    return true;
}

static inline drv8825_err_t drv8825_gpio_initialize(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_gpio_deinitialize(void* user)
{
    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_gpio_write_pin(void* user,
                                                   uint32_t pin,
                                                   bool state)
{
    joint_config_t* config = (joint_config_t*)user;

    GPIO_TypeDef* port = nullptr;
    if (pin == config->drv8825_dir_pin)
        port = config->drv8825_dir_gpio;
    else if (pin == config->drv8825_en_pin)
        port = config->drv8825_en_gpio;
    else if (pin == config->drv8825_m2_pin)
        port = config->drv8825_m2_gpio;
    else if (pin == config->drv8825_m1_pin)
        port = config->drv8825_m1_gpio;
    else if (pin == config->drv8825_m0_pin)
        port = config->drv8825_m0_gpio;

    HAL_GPIO_WritePin(port, (uint16_t)pin, (GPIO_PinState)state);

    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_initialize(void* user)
{
    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_deinitialize(void* user)
{
    return DRV8825_ERR_OK;
}

static inline drv8825_err_t drv8825_pwm_start(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    return HAL_TIM_PWM_Start_IT(config->drv8825_pwm_timer,
                                config->drv8825_pwm_channel) == HAL_OK
               ? DRV8825_ERR_OK
               : DRV8825_ERR_FAIL;
}

static inline drv8825_err_t drv8825_pwm_stop(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    return HAL_TIM_PWM_Stop_IT(config->drv8825_pwm_timer,
                               config->drv8825_pwm_channel) == HAL_OK
               ? DRV8825_ERR_OK
               : DRV8825_ERR_FAIL;
}

static inline drv8825_err_t drv8825_pwm_set_frequency(void* user,
                                                      uint32_t frequency)
{
    joint_config_t* config = (joint_config_t*)user;

    uint32_t clock_hz = HAL_RCC_GetPCLK1Freq();
    if ((RCC->CFGR & RCC_CFGR_PPRE1) != RCC_CFGR_PPRE1_DIV1) {
        clock_hz *= 2;
    }

    uint32_t period;
    uint32_t prescaler;
    bool result = frequency_to_prescaler_and_period(frequency,
                                                    clock_hz,
                                                    0xFFFFU,
                                                    0xFFFFU,
                                                    &prescaler,
                                                    &period);

    if (!result || period >= 0xFFFFU || prescaler >= 0xFFFFU) {
        return DRV8825_ERR_FAIL;
    }

    uint32_t compare = (uint32_t)((float32_t)period / 2.0F);

    __HAL_TIM_DISABLE(config->drv8825_pwm_timer);
    __HAL_TIM_SET_COUNTER(config->drv8825_pwm_timer, 0U);
    __HAL_TIM_SET_PRESCALER(config->drv8825_pwm_timer, prescaler);
    __HAL_TIM_SET_AUTORELOAD(config->drv8825_pwm_timer, period);
    __HAL_TIM_SET_COMPARE(config->drv8825_pwm_timer,
                          config->drv8825_pwm_channel,
                          compare);
    __HAL_TIM_ENABLE(config->drv8825_pwm_timer);

    ATLAS_LOG(
        TAG,
        "clock: %u, frequency: %u, period: %u, prescaler: %u, compare: %u",
        clock_hz,
        frequency,
        period,
        prescaler,
        compare);

    return DRV8825_ERR_OK;
}

static inline as5600_err_t as5600_gpio_initialize(void* user)
{
    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_gpio_deinitialize(void* user)
{
    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_gpio_write_pin(void* user,
                                                 uint32_t pin,
                                                 bool state)
{
    joint_config_t* config = (joint_config_t*)user;

    GPIO_TypeDef* gpio = NULL;
    if (pin == config->as5600_dir_pin) {
        gpio = config->as5600_dir_gpio;
    }

    HAL_GPIO_WritePin(gpio, (uint16_t)pin, (GPIO_PinState)state);

    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_adc_initialize(void* user)
{
    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_adc_deinitialize(void* user)
{
    return AS5600_ERR_OK;
}

static inline as5600_err_t as5600_bus_initialize(void* user)
{
    joint_config_t* config = (joint_config_t*)user;

    return HAL_I2C_IsDeviceReady(config->as5600_i2c_bus,
                                 config->as5600_i2c_address << 1U,
                                 10U,
                                 1000U) == HAL_OK
               ? AS5600_ERR_OK
               : AS5600_ERR_FAIL;
}

