FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
    return STEP_MOTOR_ERR_OK;
}

static inline step_motor_err_t step_motor_device_set_frequency(
    void* user,
    uint32_t frequency)
{
    ATLAS_ASSERT(user);

    joint_manager_t* manager = (joint_manager_t*)user;

    drv8825_set_frequency(&manager->drv8825, frequency);

    return STEP_MOTOR_ERR_OK;
}

static inline step_motor_err_t step_motor_device_set_direction(
    void* user,
    step_motor_direction_t direction)
{
    ATLAS_ASSERT(user);

    joint_manager_t* manager = (joint_manager_t*)user;

    drv8825_set_direction(&manager->drv8825, (drv8825_direction_t)direction);

    return STEP_MOTOR_ERR_OK;
}

static inline motor_driver_err_t motor_driver_motor_initialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_motor_deinitialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_motor_set_speed(void* user,
                                                              float32_t speed)
{
    ATLAS_ASSERT(user);

    joint_manager_t* manager = (joint_manager_t*)user;

    step_motor_set_speed(&manager->motor, speed);

    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_encoder_initialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_encoder_deinitialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_encoder_get_position(
    void* user,
    float32_t* position)
{
    ATLAS_ASSERT(user && position);

    joint_manager_t* manager = (joint_manager_t*)user;

    as5600_get_angle_data_scaled_bus(&manager->as5600, position);

    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_regulator_initialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_regulator_deinitialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_regulator_get_control(
    void* user,
    float32_t error,
    float32_t* control,
    float32_t delta_time)
{
    ATLAS_ASSERT(user && control);

    joint_manager_t* manager = (joint_manager_t*)user;

    pid_regulator_get_sat_control(&manager->regulator,
                                  error,
                                  delta_time,
                                  control);

    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_fault_initialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_fault_deinitialize(void* user)
{
    return MOTOR_DRIVER_ERR_OK;
}

static inline motor_driver_err_t motor_driver_fault_get_current(
    void* user,
    float32_t* current)
{
    ATLAS_ASSERT(user && current);

    joint_manager_t* manager = (joint_manager_t*)user;

    *current = 1.0F;

    return MOTOR_DRIVER_ERR_OK;
}

static inline bool joint_manager_has_joint_event(void)
{
    return uxQueueMessagesWaiting(queue_manager_get(QUEUE_TYPE_JOINT)) > 0U;
}

#ifdef USE_LOG_TASK
static inline bool joint_manager_send_log_notify(log_notify_t notify)
{
    return xTaskNotify(task_manager_get(TASK_TYPE_LOG), notify, eSetBits) ==
           pdPASS;
}
#endif

#ifdef USE_WATCHDOG_TASK
static inline bool joint_manager_send_watchdog_notify(log_notify_t notify)
{
    return xTaskNotify(task_manager_get(TASK_TYPE_WATCHDOG),
                       notify,
                       eSetBits) == pdPASS;
}
#endif

static inline bool joint_manager_send_system_notify(system_notify_t notify)
{
    return xTaskNotify(task_manager_get(TASK_TYPE_SYSTEM),
                       (uint32_t)notify,
                       eSetBits) == pdPASS;
}

static inline bool joint_manager_send_system_event(system_event_t const* event)
{
    ATLAS_ASSERT(event);

    return xQueueSend(queue_manager_get(QUEUE_TYPE_SYSTEM),
                      event,
                      pdMS_TO_TICKS(1)) == pdPASS;
}

static inline bool joint_manager_receive_joint_event(joint_event_t* event)
{
    ATLAS_ASSERT(event);

    return xQueueReceive(queue_manager_get(QUEUE_TYPE_JOINT),
                         event,
                         pdMS_TO_TICKS(1)) == pdPASS;
}

static inline bool joint_manager_receive_joint_notify(joint_notify_t* notify)
{
    ATLAS_ASSERT(notify);

    return xTaskNotifyWait(0,
                           JOINT_NOTIFY_ALL,
                           (uint32_t*)notify,
                           pdMS_TO_TICKS(1)) == pdPASS;
}

static inline bool joint_manager_initialize_chips(joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    if (as5600_initialize_chip(&manager->as5600,
                               manager->parameters.min_position,
                               manager->parameters.max_position,
                               manager->parameters.magnet_polarity) !=
        AS5600_ERR_OK) {
        ATLAS_LOG(TAG, "Failed as5600_initialize_chip");

        return false;
    }

    // if (ina226_initialize_chip(&manager->ina226,
    //                            0.0F,
    //                            manager->parameters.current_limit) !=
    //     INA226_ERR_OK) {
    //     ATLAS_LOG(TAG, "Failed ina226_initialize_chip");

    //     return false;
    // }

    return true;
}

static inline bool joint_manager_deinitialize_chips(joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);
}

#ifdef JOINT_TEST
static inline bool joint_manager_start_joint_test_delta_timer(
    joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    return HAL_TIM_Base_Start_IT(manager->config.joint_test_delta_timer) ==
           HAL_OK;
}

static inline bool joint_manager_stop_joint_test_delta_timer(
    joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    return HAL_TIM_Base_Stop_IT(manager->config.joint_test_delta_timer) ==
           HAL_OK;
}
#endif

static inline bool joint_manager_initialize_drivers(joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    if (as5600_initialize(
            &manager->as5600,
            &(as5600_config_t){.dir_pin = manager->config.as5600_dir_pin,
                               .max_angle = manager->parameters.max_position,
                               .min_angle = manager->parameters.min_position},
            &(as5600_interface_t){.gpio_user = &manager->config,
                                  .gpio_initialize = as5600_gpio_initialize,
                                  .gpio_deinitialize = as5600_gpio_deinitialize,
                                  .gpio_write_pin = as5600_gpio_write_pin,
                                  .adc_user = &manager->config,
                                  .adc_initialize = as5600_adc_initialize,
                                  .adc_deinitialize = as5600_adc_deinitialize,
                                  .bus_user = &manager->config,
                                  .bus_initialize = as5600_bus_initialize,
                                  .bus_deinitialize = as5600_bus_deinitialize,
                                  .bus_read_data = as5600_bus_read_data,
                                  .bus_write_data = as5600_bus_write_data}) !=
        AS5600_ERR_OK) {
        ATLAS_LOG(TAG, "Failed as5600_initialize");

