FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
        return false;
    }

    // if (ina226_initialize(
    //         &manager->ina226,
    //         &(ina226_config_t){.current_scale =
    //         ina226_current_range_to_scale(
    //                                manager->parameters.current_limit)},
    //         &(ina226_interface_t){.bus_user = &manager->config,
    //                               .bus_initialize = ina226_bus_initialize,
    //                               .bus_deinitialize =
    //                               ina226_bus_deinitialize, .bus_read_data =
    //                               ina226_bus_read_data, .bus_write_data =
    //                               ina226_bus_write_data}) !=
    //     INA226_ERR_OK) {
    //     ATLAS_LOG(TAG, "Failed ina226_initialize");

    //     return false;
    // }

    if (drv8825_initialize(
            &manager->drv8825,
            &(drv8825_config_t){.pin_dir = manager->config.drv8825_dir_pin,
                                .pin_enable = manager->config.drv8825_en_pin,
                                .pin_mode0 = manager->config.drv8825_m0_pin,
                                .pin_mode1 = manager->config.drv8825_m1_pin,
                                .pin_mode2 = manager->config.drv8825_m2_pin},
            &(drv8825_interface_t){
                .gpio_user = &manager->config,
                .gpio_initialize = drv8825_gpio_initialize,
                .gpio_deinitialize = drv8825_gpio_deinitialize,
                .gpio_write_pin = drv8825_gpio_write_pin,
                .pwm_user = &manager->config,
                .pwm_initialize = drv8825_pwm_initialize,
                .pwm_deinitialize = drv8825_pwm_deinitialize,
                .pwm_start = drv8825_pwm_start,
                .pwm_stop = drv8825_pwm_stop,
                .pwm_set_frequency = drv8825_pwm_set_frequency}) !=
        DRV8825_ERR_OK) {
        ATLAS_LOG(TAG, "Failed drv8825_initialize");

        return false;
    }

    if (step_motor_initialize(
            &manager->motor,
            &(step_motor_config_t){
                .min_position = manager->parameters.min_position,
                .max_position = manager->parameters.max_position,
                .min_speed = manager->parameters.min_speed,
                .max_speed = manager->parameters.max_speed,
                .step_change = manager->parameters.step_change *
                               drv8825_microstep_to_fraction(
                                   manager->parameters.microstep)},
            &(step_motor_interface_t){
                .device_user = manager,
                .device_initialize = step_motor_device_initialize,
                .device_deinitialize = step_motor_device_deinitialize,
                .device_set_frequency = step_motor_device_set_frequency,
                .device_set_direction = step_motor_device_set_direction},
            0.0F) != STEP_MOTOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed step_motor_initialize");

        return false;
    }

    if (pid_regulator_initialize(
            &manager->regulator,
            &(pid_regulator_config_t){
                .prop_gain = manager->parameters.prop_gain,
                .int_gain = manager->parameters.int_gain,
                .dot_gain = manager->parameters.dot_gain,
                .sat_gain = manager->parameters.sat_gain,
                .min_control = manager->parameters.min_speed,
                .max_control = manager->parameters.max_speed,
                .dead_error = manager->parameters.dead_error}) !=
        PID_REGULATOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed pid_regulator_initialize");

        return false;
    }

    if (motor_driver_initialize(
            &manager->driver,
            &(motor_driver_config_t){
                .min_position = manager->parameters.min_position,
                .max_position = manager->parameters.max_position,
                .min_speed = manager->parameters.min_speed,
                .max_speed = manager->parameters.max_speed,
                .min_acceleration = manager->parameters.min_acceleration,
                .max_acceleration = manager->parameters.max_acceleration,
                .max_current = manager->parameters.current_limit},
            &(motor_driver_interface_t){
                .motor_user = manager,
                .motor_initialize = motor_driver_motor_initialize,
                .motor_deinitialize = motor_driver_motor_deinitialize,
                .motor_set_speed = motor_driver_motor_set_speed,
                .encoder_user = manager,
                .encoder_initialize = motor_driver_encoder_initialize,
                .encoder_deinitialize = motor_driver_encoder_deinitialize,
                .encoder_get_position = motor_driver_encoder_get_position,
                .regulator_user = manager,
                .regulator_initialize = motor_driver_regulator_initialize,
                .regulator_deinitialize = motor_driver_regulator_deinitialize,
                .regulator_get_control = motor_driver_regulator_get_control,
                .fault_user = manager,
                .fault_initialize = motor_driver_fault_initialize,
                .fault_deinitialize = motor_driver_fault_deinitialize,
                .fault_get_current = motor_driver_fault_get_current}) !=
        MOTOR_DRIVER_ERR_OK) {
        ATLAS_LOG(TAG, "Failed motor_driver_initialize");

        return false;
    }

    return true;
}

static inline bool joint_manager_deinitialize_drivers(joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    if (as5600_deinitialize(&manager->as5600) != AS5600_ERR_OK) {
        ATLAS_LOG(TAG, "Failed as5600_deinitialize");

        return false;
    }

    // if (ina226_deinitialize(&manager->ina226) != INA226_ERR_OK) {
    //     ATLAS_LOG(TAG, "Failed ina226_deinitialize");

    //     return false;
    // }

    if (drv8825_deinitialize(&manager->drv8825) != DRV8825_ERR_OK) {
        ATLAS_LOG(TAG, "Failed drv8825_deinitialize");

        return false;
    }

    if (step_motor_deinitialize(&manager->motor) != STEP_MOTOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed step_motor_deinitialize");

