FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
        return false;
    }

    if (pid_regulator_deinitialize(&manager->regulator) !=
        PID_REGULATOR_ERR_OK) {
        ATLAS_LOG(TAG, "Failed pid_regulator_deinitialize");

        return false;
    }

    if (motor_driver_deinitialize(&manager->driver) != MOTOR_DRIVER_ERR_OK) {
        ATLAS_LOG(TAG, "Failed motor_driver_deinitialize");

        return false;
    }

    return true;
}

#ifdef JOINT_TEST
static atlas_joint_reference_t trajectory[] = {
    {.delta_time = 0.05F, .position = 0.0F},
    {.delta_time = 0.05F, .position = 50.0F},
    {.delta_time = 0.05F, .position = 100.0F},
    {.delta_time = 0.05F, .position = 50.0F},
    {.delta_time = 0.05F, .position = 0.0F}};

static uint32_t const traj_len = sizeof(trajectory) / sizeof(*trajectory);
static uint32_t i = 0U;
#endif

static atlas_err_t joint_manager_notify_delta_elapsed_handler(
    joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    if (manager->reference.delta_time == 0.0F ||
        manager->state == ATLAS_JOINT_STATE_FAULT) {
        return ATLAS_ERR_FAIL;
    }

    motor_driver_err_t err =
        motor_driver_set_position(&manager->driver,
                                  manager->reference.position,
                                  manager->reference.delta_time);

    if (err != MOTOR_DRIVER_ERR_OK) {
        motor_driver_set_speed(&manager->driver,
                               0.0F,
                               manager->reference.delta_time);
        manager->state = ATLAS_JOINT_STATE_FAULT;

        return ATLAS_ERR_FAIL;
    }

    motor_driver_state_t state;
    motor_driver_get_state(&manager->driver, &state);

    ATLAS_LOG(TAG,
              "measure: %.3f, reference: %.3f, error: %.3f, control: %.3f, "
              "current: %.3f",
              state.measure_position,
              manager->reference.position,
              state.measure_position - manager->reference.position,
              state.control_speed,
              state.fault_current);

    manager->measure.position = state.measure_position;
    manager->measure.current = state.fault_current;

#ifdef JOINT_TEST
    if (fabsf(manager->reference.position - manager->measure.position) <
        0.05F) {
        if (i < traj_len) {
            manager->reference = trajectory[i++];
        }

        if (i >= traj_len) {
            joint_manager_stop_joint_test_delta_timer(manager);
            manager->state = ATLAS_JOINT_STATE_READY;
        }
    }
#endif

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_notify_pwm_pulse_handler(
    joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    step_motor_update_step_count(&manager->motor);

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_notify_handler(joint_manager_t* manager,
                                                joint_notify_t notify)
{
    ATLAS_ASSERT(manager);

    if ((notify & JOINT_NOTIFY_DELTA_ELAPSED) == JOINT_NOTIFY_DELTA_ELAPSED) {
        ATLAS_RET_ON_ERR(joint_manager_notify_delta_elapsed_handler(manager));
    }
    if ((notify & JOINT_NOTIFY_PWM_PULSE) == JOINT_NOTIFY_PWM_PULSE) {
        ATLAS_RET_ON_ERR(joint_manager_notify_pwm_pulse_handler(manager));
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_start_handler(
    joint_manager_t* manager,
    joint_event_payload_start_t const* start)
{
    ATLAS_ASSERT(manager && start);
    ATLAS_LOG_FUNC(TAG);

    if (manager->is_running) {
        return ATLAS_ERR_ALREADY_RUNNING;
    }

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_STARTED,
                            .payload.joint_started = {}};
    if (!joint_manager_send_system_event(&event)) {
        return ATLAS_ERR_FAIL;
    }

    manager->is_running = true;
    manager->state = ATLAS_JOINT_STATE_READY;

#ifdef JOINT_TEST

    manager->state = ATLAS_JOINT_STATE_RUNNING;
    manager->reference = trajectory[0U];

    joint_manager_start_joint_test_delta_timer(manager);
#endif

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_stop_handler(
    joint_manager_t* manager,
    joint_event_payload_stop_t const* stop)
{
    ATLAS_ASSERT(manager && stop);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_STOPPED,
                            .payload.joint_stopped = {}};
    if (!joint_manager_send_system_event(&event)) {
        return ATLAS_ERR_FAIL;
    }

    manager->is_running = false;
    manager->state = ATLAS_JOINT_STATE_IDLE;

    return ATLAS_ERR_OK;
}

static inline bool joint_manager_send_response(
    atlas_joint_response_t const* response)
{
    ATLAS_ASSERT(response);

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_RESPONSE,
                            .payload.joint_response.response = *response};
    return joint_manager_send_system_event(&event);
}

static atlas_err_t joint_manager_command_get_state_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_get_state_t const* get_state)
{
    ATLAS_ASSERT(manager && get_state);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_GET_STATE};

    if (manager->state != ATLAS_JOINT_STATE_UNKNOWN) {
        response.payload.get_state.state = manager->state;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_set_state_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_set_state_t const* set_state)
{
    ATLAS_ASSERT(manager && set_state);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_SET_STATE};

