FranciszekJanicki/stm32_cubemx_atlas_joint/components/atlas_joint/joint_task/joint_manager.c
    if ((manager->state == ATLAS_JOINT_STATE_READY &&
         set_state->state == ATLAS_JOINT_STATE_RUNNING) ||
        (manager->state == ATLAS_JOINT_STATE_RUNNING &&
         set_state->state == ATLAS_JOINT_STATE_READY)) {
        manager->state = set_state->state;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_set_reference_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_set_reference_t const* set_reference)
{
    ATLAS_ASSERT(manager && set_reference);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_SET_REFERENCE};

    if (manager->state == ATLAS_JOINT_STATE_RUNNING) {
        manager->reference = set_reference->reference;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_get_measure_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_get_measure_t const* get_measure)
{
    ATLAS_ASSERT(manager && get_measure);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_GET_MEASURE};

    if (manager->state == ATLAS_JOINT_STATE_RUNNING) {
        response.payload.get_measure.measure = manager->measure;
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_command_set_parameters_handler(
    joint_manager_t* manager,
    atlas_joint_command_payload_set_parameters_t const* set_parameters)
{
    ATLAS_ASSERT(manager && set_parameters);
    ATLAS_LOG_FUNC(TAG);

    atlas_joint_response_t response = {
        .result = ATLAS_JOINT_RESPONSE_RESULT_FAILURE,
        .type = ATLAS_JOINT_RESPONSE_TYPE_SET_PARAMETERS};

    if (manager->state == ATLAS_JOINT_STATE_READY) {
        if (!joint_manager_deinitialize_drivers(manager)) {
            return ATLAS_ERR_FAIL;
        }
        manager->parameters = set_parameters->parameters;
        if (!joint_manager_initialize_drivers(manager)) {
            return ATLAS_ERR_FAIL;
        }
        response.result = ATLAS_JOINT_RESPONSE_RESULT_SUCCESS;
    }

    if (!joint_manager_send_response(&response)) {
        return ATLAS_ERR_FAIL;
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_joint_command_handler(
    joint_manager_t* manager,
    joint_event_payload_joint_command_t const* joint_command)
{
    ATLAS_ASSERT(manager && joint_command);
    ATLAS_LOG_FUNC(TAG);

    if (!manager->is_running) {
        return ATLAS_ERR_NOT_RUNNING;
    }

    atlas_joint_command_t const* command = &joint_command->command;
    switch (command->type) {
        case ATLAS_JOINT_COMMAND_TYPE_GET_STATE: {
            return joint_manager_command_get_state_handler(
                manager,
                &command->payload.get_state);
        }
        case ATLAS_JOINT_COMMAND_TYPE_SET_STATE: {
            return joint_manager_command_set_state_handler(
                manager,
                &command->payload.set_state);
        }
        case ATLAS_JOINT_COMMAND_TYPE_SET_REFERENCE: {
            return joint_manager_command_set_reference_handler(
                manager,
                &command->payload.set_reference);
        }
        case ATLAS_JOINT_COMMAND_TYPE_GET_MEASURE: {
            return joint_manager_command_get_measure_handler(
                manager,
                &command->payload.get_measure);
        }
        case ATLAS_JOINT_COMMAND_TYPE_SET_PARAMETERS: {
            return joint_manager_command_set_parameters_handler(
                manager,
                &command->payload.set_parameters);
        }
        default: {
            return ATLAS_ERR_UNKNOWN_EVENT;
        }
    }

    return ATLAS_ERR_OK;
}

static atlas_err_t joint_manager_event_handler(joint_manager_t* manager,
                                               joint_event_t const* event)
{
    ATLAS_ASSERT(manager && event);

    switch (event->type) {
        case JOINT_EVENT_TYPE_START: {
            return joint_manager_event_start_handler(manager,
                                                     &event->payload.start);
        }
        case JOINT_EVENT_TYPE_STOP: {
            return joint_manager_event_stop_handler(manager,
                                                    &event->payload.stop);
        }
        case JOINT_EVENT_TYPE_JOINT_COMMAND: {
            return joint_manager_event_joint_command_handler(
                manager,
                &event->payload.joint_command);
        }
        default: {
            return ATLAS_ERR_UNKNOWN_EVENT;
        }
    }
}

atlas_err_t joint_manager_process(joint_manager_t* manager)
{
    ATLAS_ASSERT(manager);

    joint_notify_t notify;
    if (joint_manager_receive_joint_notify(&notify)) {
        ATLAS_LOG_ON_ERR(TAG, joint_manager_notify_handler(manager, notify));
    }

    joint_event_t event;
    while (joint_manager_has_joint_event()) {
        if (joint_manager_receive_joint_event(&event)) {
            ATLAS_LOG_ON_ERR(TAG, joint_manager_event_handler(manager, &event));
        }
    }

#ifdef USE_WATCHDOG_TASK
    if (!joint_manager_send_watchdog_notify(WATCHDOG_NOTIFY_JOINT_ALIVE)) {
        return ATLAS_ERR_FAIL;
    }
#endif

    return ATLAS_ERR_OK;
}

atlas_err_t joint_manager_initialize(joint_manager_t* manager,
                                     joint_config_t const* config,
                                     joint_parameters_t const* parameters)
{
    ATLAS_ASSERT(manager && config && parameters);

    manager->is_running = false;
    manager->state = ATLAS_JOINT_STATE_IDLE;
    manager->measure.current = 0.0F;
    manager->measure.position = 0.0F;
    manager->reference.position = 0.0F;
    manager->reference.delta_time = 0.0F;
    manager->config = *config;
    manager->parameters = *parameters;

    if (!joint_manager_initialize_drivers(manager)) {
        return ATLAS_ERR_FAIL;
    }

    if (!joint_manager_initialize_chips(manager)) {
        return ATLAS_ERR_FAIL;
    }

    system_event_t event = {.origin = SYSTEM_EVENT_ORIGIN_JOINT,
                            .type = SYSTEM_EVENT_TYPE_JOINT_READY,
                            .payload.joint_ready = {}};
    if (!joint_manager_send_system_event(&event)) {
        return ATLAS_ERR_FAIL;
    }

#ifdef USE_WATCHDOG_TASK
    if (!joint_manager_send_watchdog_notify(WATCHDOG_NOTIFY_JOINT_ALIVE)) {
        return ATLAS_ERR_FAIL;
    }
#endif

    return ATLAS_ERR_OK;
}
